Adding lecture 3
